{"@ID": "828", "@Name": "Signal Handler with Functionality that is not Asynchronous-Safe", "@Abstraction": "Variant", "@Structure": "Simple", "@Status": "Incomplete", "Description": "The product defines a signal handler that contains code sequences that are not asynchronous-safe, i.e., the functionality is not reentrant, or it can be interrupted.", "Extended_Description": {"xhtml:p": ["This can lead to an unexpected system state with a variety of potential consequences depending on context, including denial of service and code execution.", "Signal handlers are typically intended to interrupt normal functionality of a program, or even other signals, in order to notify the process of an event. When a signal handler uses global or static variables, or invokes functions that ultimately depend on such state or its associated metadata, then it could corrupt system state that is being used by normal functionality. This could subject the program to race conditions or other weaknesses that allow an attacker to cause the program state to be corrupted. While denial of service is frequently the consequence, in some cases this weakness could be leveraged for code execution.", "There are several different scenarios that introduce this issue:", "Note that in some environments or contexts, it might be possible for the signal handler to be interrupted itself.", "If both a signal handler and the normal behavior of the product have to operate on the same set of state variables, and a signal is received in the middle of the normal execution's modifications of those variables, the variables may be in an incorrect or corrupt state during signal handler execution, and possibly still incorrect or corrupt upon return."], "xhtml:ul": {"xhtml:li": ["Invocation of non-reentrant functions from within the handler. One example is malloc(), which modifies internal global variables as it manages memory. Very few functions are actually reentrant.", "Code sequences (not necessarily function calls) contain non-atomic use of global variables, or associated metadata or structures, that can be accessed by other functionality of the program, including other signal handlers. Frequently, the same function is registered to handle multiple signals.", "The signal handler function is intended to run at most one time, but instead it can be invoked multiple times. This could happen by repeated delivery of the same signal, or by delivery of different signals that have the same handler function (CWE-831)."]}}, "Related_Weaknesses": {"Related_Weakness": {"@Nature": "ChildOf", "@CWE_ID": "364", "@View_ID": "1000", "@Ordinal": "Primary"}}, "Common_Consequences": {"Consequence": {"Scope": ["Integrity", "Confidentiality", "Availability"], "Impact": ["DoS: Crash, Exit, or Restart", "Execute Unauthorized Code or Commands"], "Note": "The most common consequence will be a corruption of the state of the product, possibly leading to a crash or exit. However, if the signal handler is operating on state variables for security relevant libraries or protection mechanisms, the consequences can be far more severe, including protection mechanism bypass, privilege escalation, or information exposure."}}, "Potential_Mitigations": {"Mitigation": [{"Phase": ["Implementation", "Architecture and Design"], "Description": {"xhtml:p": ["Eliminate the usage of non-reentrant functionality inside of signal handlers. This includes replacing all non-reentrant library calls with reentrant calls.", "Note: This will not always be possible and may require large portions of the product to be rewritten or even redesigned. Sometimes reentrant-safe library alternatives will not be available. Sometimes non-reentrant interaction between the state of the system and the signal handler will be required by design."]}, "Effectiveness": "High"}, {"Phase": "Implementation", "Description": "Where non-reentrant functionality must be leveraged within a signal handler, be sure to block or mask signals appropriately. This includes blocking other signals within the signal handler itself that may also leverage the functionality. It also includes blocking all signals reliant upon the functionality when it is being accessed or modified by the normal behaviors of the product."}]}, "Demonstrative_Examples": {"Demonstrative_Example": [{"@Demonstrative_Example_ID": "DX-26", "Intro_Text": "This code registers the same signal handler function with two different signals (CWE-831). If those signals are sent to the process, the handler creates a log message (specified in the first argument to the program) and exits.", "Example_Code": {"@Nature": "Bad", "@Language": "C", "xhtml:div": {"xhtml:br": [null, null, null, null], "xhtml:div": [{"@style": "margin-left:1em;", "xhtml:div": {"xhtml:br": [null, null, null, null, null], "xhtml:i": "/* artificially increase the size of the timing window to make demonstration of this weakness easier. */", "#text": "syslog(LOG_NOTICE, \"%s\\n\", logMessage);free(logMessage);\n                           \n                           \n                           sleep(10);exit(0);"}}, {"@style": "margin-left:1em;", "xhtml:div": {"xhtml:br": [null, null, null, null, null, null, null], "xhtml:i": ["/* Register signal handlers. */", "/* artificially increase the size of the timing window to make demonstration of this weakness easier. */"], "#text": "logMessage = strdup(argv[1]);\n                           \n                           \n                           signal(SIGHUP, handler);signal(SIGTERM, handler);\n                           \n                           \n                           sleep(10);"}}], "#text": "char *logMessage;\n                     void handler (int sigNum) {}\n                     int main (int argc, char* argv[]) {}"}}, "Body_Text": ["The handler function uses global state (globalVar and logMessage), and it can be called by both the SIGHUP and SIGTERM signals. An attack scenario might follow these lines:", {"xhtml:ul": {"xhtml:li": [{"xhtml:div": "The program begins execution, initializes logMessage, and registers the signal handlers for SIGHUP and SIGTERM."}, {"xhtml:div": "The program begins its \"normal\" functionality, which is simplified as sleep(), but could be any functionality that consumes some time."}, {"xhtml:div": "The attacker sends SIGHUP, which invokes handler (call this \"SIGHUP-handler\")."}, {"xhtml:div": "SIGHUP-handler begins to execute, calling syslog()."}, {"xhtml:div": "syslog() calls malloc(), which is non-reentrant. malloc() begins to modify metadata to manage the heap."}, {"xhtml:div": "The attacker then sends SIGTERM."}, {"xhtml:div": "SIGHUP-handler is interrupted, but syslog's malloc call is still executing and has not finished modifying its metadata."}, {"xhtml:div": "The SIGTERM handler is invoked."}, {"xhtml:div": "SIGTERM-handler records the log message using syslog(), then frees the logMessage variable."}]}}, "At this point, the state of the heap is uncertain, because malloc is still modifying the metadata for the heap; the metadata might be in an inconsistent state. The SIGTERM-handler call to free() is assuming that the metadata is inconsistent, possibly causing it to write data to the wrong location while managing the heap. The result is memory corruption, which could lead to a crash or even code execution, depending on the circumstances under which the code is running.", "Note that this is an adaptation of a classic example as originally presented by Michal Zalewski [REF-360]; the original example was shown to be exploitable for code execution.", "Also note that the strdup(argv[1]) call contains a potential buffer over-read (CWE-126) if the program is called without any arguments, because argc would be 0, and argv[1] would point outside the bounds of the array."]}, {"@Demonstrative_Example_ID": "DX-48", "Intro_Text": "The following code registers a signal handler with multiple signals in order to log when a specific event occurs and to free associated memory before exiting.", "Example_Code": {"@Nature": "Bad", "@Language": "C", "xhtml:div": {"xhtml:br": [null, null, null, null, null, null, null, null, null], "xhtml:div": [{"@style": "margin-left:1em;", "xhtml:div": {"xhtml:br": [null, null, null, null, null, null], "xhtml:i": "/* Sleep statements added to expand timing window for race condition */", "#text": "syslog(LOG_NOTICE,\"%s\\n\",what);free(global2);free(global1);\n                           \n                           \n                           sleep(10);exit(0);"}}, {"@style": "margin-left:1em;", "xhtml:div": {"xhtml:br": [null, null, null, null, null, null, null, null], "xhtml:i": "/* Sleep statements added to expand timing window for race condition */", "#text": "what=argv[1];global1=strdup(argv[2]);global2=malloc(340);signal(SIGHUP,sh);signal(SIGTERM,sh);\n                           \n                           \n                           sleep(10);exit(0);"}}], "#text": "#include <signal.h>#include <syslog.h>#include <string.h>#include <stdlib.h>\n                     void *global1, *global2;char *what;void sh (int dummy) {}\n                     int main (int argc,char* argv[]) {}"}}, "Body_Text": ["However, the following sequence of events may result in a double-free (CWE-415):", {"xhtml:ol": {"xhtml:li": [{"xhtml:div": "a SIGHUP is delivered to the process"}, {"xhtml:div": "sh() is invoked to process the SIGHUP"}, {"xhtml:div": "This first invocation of sh() reaches the point where global1 is freed"}, {"xhtml:div": "At this point, a SIGTERM is sent to the process"}, {"xhtml:div": "the second invocation of sh() might do another free of global1"}, {"xhtml:div": "this results in a double-free (CWE-415)"}]}}, "This is just one possible exploitation of the above code. As another example, the syslog call may use malloc calls which are not async-signal safe. This could cause corruption of the heap management structures. For more details, consult the example within \"Delivering Signals for Fun and Profit\" [REF-360]."]}]}, "Observed_Examples": {"Observed_Example": [{"Reference": "CVE-2008-4109", "Description": "Signal handler uses functions that ultimately call the unsafe syslog/malloc/s*printf, leading to denial of service via multiple login attempts", "Link": "https://www.cve.org/CVERecord?id=CVE-2008-4109"}, {"Reference": "CVE-2006-5051", "Description": "Chain: Signal handler contains too much functionality (CWE-828), introducing a race condition (CWE-362) that leads to a double free (CWE-415).", "Link": "https://www.cve.org/CVERecord?id=CVE-2006-5051"}, {"Reference": "CVE-2001-1349", "Description": "unsafe calls to library functions from signal handler", "Link": "https://www.cve.org/CVERecord?id=CVE-2001-1349"}, {"Reference": "CVE-2004-0794", "Description": "SIGURG can be used to remotely interrupt signal handler; other variants exist.", "Link": "https://www.cve.org/CVERecord?id=CVE-2004-0794"}, {"Reference": "CVE-2004-2259", "Description": "SIGCHLD signal to FTP server can cause crash under heavy load while executing non-reentrant functions like malloc/free.", "Link": "https://www.cve.org/CVERecord?id=CVE-2004-2259"}, {"Reference": "CVE-2002-1563", "Description": "SIGCHLD not blocked in a daemon loop while counter is modified, causing counter to get out of sync.", "Link": "https://www.cve.org/CVERecord?id=CVE-2002-1563"}]}, "Taxonomy_Mappings": {"Taxonomy_Mapping": {"@Taxonomy_Name": "CERT C Secure Coding", "Entry_ID": "SIG31-C", "Entry_Name": "Do not access or modify shared objects in signal handlers"}}, "References": {"Reference": [{"@External_Reference_ID": "REF-360"}, {"@External_Reference_ID": "REF-361"}]}, "Content_History": {"Submission": {"Submission_Name": "CWE Content Team", "Submission_Organization": "MITRE", "Submission_Date": "2010-11-08"}, "Modification": [{"Modification_Name": "CWE Content Team", "Modification_Organization": "MITRE", "Modification_Date": "2011-06-01", "Modification_Comment": "updated Common_Consequences"}, {"Modification_Name": "CWE Content Team", "Modification_Organization": "MITRE", "Modification_Date": "2012-05-11", "Modification_Comment": "updated Demonstrative_Examples"}, {"Modification_Name": "CWE Content Team", "Modification_Organization": "MITRE", "Modification_Date": "2014-06-23", "Modification_Comment": "updated Demonstrative_Examples, References"}, {"Modification_Name": "CWE Content Team", "Modification_Organization": "MITRE", "Modification_Date": "2017-11-08", "Modification_Comment": "updated Observed_Examples"}, {"Modification_Name": "CWE Content Team", "Modification_Organization": "MITRE", "Modification_Date": "2020-02-24", "Modification_Comment": "updated Relationships"}, {"Modification_Name": "CWE Content Team", "Modification_Organization": "MITRE", "Modification_Date": "2021-03-15", "Modification_Comment": "updated Demonstrative_Examples"}, {"Modification_Name": "CWE Content Team", "Modification_Organization": "MITRE", "Modification_Date": "2022-04-28", "Modification_Comment": "updated Observed_Examples"}, {"Modification_Name": "CWE Content Team", "Modification_Organization": "MITRE", "Modification_Date": "2023-01-31", "Modification_Comment": "updated Common_Consequences, Description, Potential_Mitigations"}, {"Modification_Name": "CWE Content Team", "Modification_Organization": "MITRE", "Modification_Date": "2023-04-27", "Modification_Comment": "updated References, Relationships, Type"}]}}