{"cwe": {"@ID": "1283", "@Name": "Mutable Attestation or Measurement Reporting Data", "@Abstraction": "Base", "@Structure": "Simple", "@Status": "Incomplete", "Description": "The register contents used for attestation or measurement reporting data to verify boot flow are modifiable by an adversary.", "Extended_Description": {"xhtml:p": "A System-on-Chip (SoC) implements secure boot or verified boot. During this boot flow, the SoC often measures the code that it authenticates. The measurement is usually done by calculating the one-way hash of the code binary and extending it to the previous hash. The hashing algorithm should be a Secure One-Way hash function. The final hash, i.e., the value obtained after the completion of the boot flow, serves as the measurement data used in reporting or in attestation. The calculated hash is often stored in registers that can later be read by the party of interest to determine tampering of the boot flow. A common weakness is that the contents in these registers are modifiable by an adversary, thus spoofing the measurement."}, "Related_Weaknesses": {"Related_Weakness": {"@Nature": "ChildOf", "@CWE_ID": "284", "@View_ID": "1000", "@Ordinal": "Primary"}}, "Applicable_Platforms": {"Language": {"@Class": "Not Language-Specific", "@Prevalence": "Undetermined"}, "Operating_System": {"@Class": "Not OS-Specific", "@Prevalence": "Undetermined"}, "Architecture": {"@Class": "Not Architecture-Specific", "@Prevalence": "Undetermined"}, "Technology": {"@Class": "Not Technology-Specific", "@Prevalence": "Undetermined"}}, "Modes_Of_Introduction": {"Introduction": [{"Phase": "Architecture and Design", "Note": "Such issues can be introduced during hardware architecture or design and can be identified later during Testing or System Configuration phases."}, {"Phase": "Implementation", "Note": "If the access-controls which protecting the reporting registers are misconfigured during implementation, this weakness can arise."}]}, "Common_Consequences": {"Consequence": {"Scope": "Confidentiality", "Impact": ["Read Memory", "Read Application Data"]}}, "Potential_Mitigations": {"Mitigation": {"Phase": "Architecture and Design", "Description": {"xhtml:p": "Measurement data should be stored in registers that are read-only or otherwise have access controls that prevent modification by an untrusted agent."}}}, "Demonstrative_Examples": {"Demonstrative_Example": {"Intro_Text": "The SoC extends the hash and stores the results in registers. Without protection, an adversary can write their chosen hash values to these registers. Thus, the attacker controls the reported results.", "Body_Text": {"xhtml:p": "To prevent the above scenario, the registers should have one or more of the following properties:", "xhtml:ul": {"xhtml:li": ["Should be Read-Only with respect to an adversary", "Cannot be extended or modifiable either directly or indirectly (using a trusted agent as proxy) by an adversary", "Should have appropriate access controls or protections"]}}}}, "Related_Attack_Patterns": {"Related_Attack_Pattern": {"@CAPEC_ID": "680"}}, "References": {"Reference": [{"@External_Reference_ID": "REF-1107"}, {"@External_Reference_ID": "REF-1131"}]}, "Notes": {"Note": {"@Type": "Maintenance", "#text": "This entry is still in development and will continue to see updates and content improvements."}}, "Content_History": {"Submission": {"Submission_Name": "Arun Kanuparthi, Hareesh Khattri, Parbati Kumar Manna, Narasimha Kumar V Mangipudi", "Submission_Organization": "Intel Corporation", "Submission_Date": "2020-04-25"}, "Modification": [{"Modification_Name": "CWE Content Team", "Modification_Organization": "MITRE", "Modification_Date": "2020-08-20", "Modification_Comment": "updated References, Related_Attack_Patterns"}, {"Modification_Name": "CWE Content Team", "Modification_Organization": "MITRE", "Modification_Date": "2022-04-28", "Modification_Comment": "updated Related_Attack_Patterns"}, {"Modification_Name": "CWE Content Team", "Modification_Organization": "MITRE", "Modification_Date": "2023-04-27", "Modification_Comment": "updated Relationships"}]}}, "copyright": "Copyright © 2006–2023, The MITRE Corporation. CWE, CWSS, CWRAF, and the CWE logo are trademarks of The MITRE Corporation.", "license": "CWE Usage: MITRE hereby grants you a non-exclusive, royalty-free license to use CWE for research, development, and commercial purposes. Any copy you make for such purposes is authorized on the condition that you reproduce MITRE’s copyright designation and this license in any such copy."}