{"cwe": {"@ID": "400", "@Name": "Uncontrolled Resource Consumption", "@Abstraction": "Class", "@Structure": "Simple", "@Status": "Draft", "Description": "The product does not properly control the allocation and maintenance of a limited resource, thereby enabling an actor to influence the amount of resources consumed, eventually leading to the exhaustion of available resources.", "Extended_Description": {"xhtml:p": ["Limited resources include memory, file system storage, database connection pool entries, and CPU. If an attacker can trigger the allocation of these limited resources, but the number or size of the resources is not controlled, then the attacker could cause a denial of service that consumes all available resources. This would prevent valid users from accessing the product, and it could potentially have an impact on the surrounding environment. For example, a memory exhaustion attack against an application could slow down the application as well as its host operating system.", "There are at least three distinct scenarios which can commonly lead to resource exhaustion:", "Resource exhaustion problems are often result due to an incorrect implementation of the following situations:"], "xhtml:ul": [{"xhtml:li": ["Lack of throttling for the number of allocated resources", "Losing all references to a resource before reaching the shutdown stage", "Not closing/returning a resource after processing"]}, {"xhtml:li": ["Error conditions and other exceptional circumstances.", "Confusion over which part of the program is responsible for releasing the resource."]}]}, "Related_Weaknesses": {"Related_Weakness": {"@Nature": "ChildOf", "@CWE_ID": "664", "@View_ID": "1000", "@Ordinal": "Primary"}}, "Applicable_Platforms": {"Language": {"@Class": "Not Language-Specific", "@Prevalence": "Undetermined"}}, "Alternate_Terms": {"Alternate_Term": {"Term": "Resource Exhaustion"}}, "Modes_Of_Introduction": {"Introduction": [{"Phase": "Operation"}, {"Phase": "Architecture and Design"}, {"Phase": "Implementation"}]}, "Likelihood_Of_Exploit": "High", "Common_Consequences": {"Consequence": [{"Scope": "Availability", "Impact": ["DoS: Crash, Exit, or Restart", "DoS: Resource Consumption (CPU)", "DoS: Resource Consumption (Memory)", "DoS: Resource Consumption (Other)"], "Note": "The most common result of resource exhaustion is denial of service. The product may slow down, crash due to unhandled errors, or lock out legitimate users."}, {"Scope": ["Access Control", "Other"], "Impact": ["Bypass Protection Mechanism", "Other"], "Note": "In some cases it may be possible to force the product to \"fail open\" in the event of resource exhaustion. The state of the product -- and possibly the security functionality - may then be compromised."}]}, "Detection_Methods": {"Detection_Method": [{"Method": "Automated Static Analysis", "Description": {"xhtml:p": ["Automated static analysis typically has limited utility in recognizing resource exhaustion problems, except for program-independent system resources such as files, sockets, and processes. For system resources, automated static analysis may be able to detect circumstances in which resources are not released after they have expired. Automated analysis of configuration files may be able to detect settings that do not specify a maximum value.", "Automated static analysis tools will not be appropriate for detecting exhaustion of custom resources, such as an intended security policy in which a bulletin board user is only allowed to make a limited number of posts per day."]}, "Effectiveness": "Limited"}, {"Method": "Automated Dynamic Analysis", "Description": "Certain automated dynamic analysis techniques may be effective in spotting resource exhaustion problems, especially with resources such as processes, memory, and connections. The technique may involve generating a large number of requests to the product within a short time frame.", "Effectiveness": "Moderate"}, {"Method": "Fuzzing", "Description": "While fuzzing is typically geared toward finding low-level implementation bugs, it can inadvertently find resource exhaustion problems. This can occur when the fuzzer generates a large number of test cases but does not restart the targeted product in between test cases. If an individual test case produces a crash, but it does not do so reliably, then an inability to handle resource exhaustion may be the cause.", "Effectiveness": "Opportunistic"}]}, "Potential_Mitigations": {"Mitigation": [{"Phase": "Architecture and Design", "Description": "Design throttling mechanisms into the system architecture. The best protection is to limit the amount of resources that an unauthorized user can cause to be expended. A strong authentication and access control model will help prevent such attacks from occurring in the first place. The login application should be protected against DoS attacks as much as possible. Limiting the database access, perhaps by caching result sets, can help minimize the resources expended. To further limit the potential for a DoS attack, consider tracking the rate of requests received from users and blocking requests that exceed a defined rate threshold."}, {"Phase": "Architecture and Design", "Description": {"xhtml:p": ["Mitigation of resource exhaustion attacks requires that the target system either:", "The first of these solutions is an issue in itself though, since it may allow attackers to prevent the use of the system by a particular valid user. If the attacker impersonates the valid user, they may be able to prevent the user from accessing the server in question.", "The second solution is simply difficult to effectively institute -- and even when properly done, it does not provide a full solution. It simply makes the attack require more resources on the part of the attacker."], "xhtml:ul": {"xhtml:li": ["recognizes the attack and denies that user further access for a given amount of time, or", "uniformly throttles all requests in order to make it more difficult to consume resources more quickly than they can again be freed."]}}}, {"Phase": "Architecture and Design", "Description": "Ensure that protocols have specific limits of scale placed on them."}, {"Phase": "Implementation", "Description": "Ensure that all failures in resource allocation place the system into a safe posture."}]}, "Demonstrative_Examples": {"Demonstrative_Example": [{"Intro_Text": "The following example demonstrates the weakness.", "Example_Code": {"@Nature": "Bad", "@Language": "Java", "xhtml:div": {"xhtml:div": {"@style": "margin-left:1em;", "xhtml:div": {"xhtml:br": [null, null, null, null, null], "xhtml:div": [{"@style": "margin-left:1em;", "xhtml:div": {"xhtml:br": [null, null], "xhtml:div": [{"@style": "margin-left:1em;", "#text": "..."}, {"@style": "margin-left:1em;", "xhtml:div": {"xhtml:br": [null, null], "xhtml:i": "// postpone response", "#text": "Thread.currentThread().interrupt();"}}], "#text": "try {}catch (InterruptedException ie) {}"}}, {"@style": "margin-left:1em;", "#text": "..."}, {"@style": "margin-left:1em;", "xhtml:div": {"xhtml:br": [null, null], "xhtml:div": {"@style": "margin-left:1em;", "xhtml:div": {"xhtml:br": null, "xhtml:div": {"@style": "margin-left:1em;", "xhtml:div": {"xhtml:br": [null, null], "xhtml:div": [{"@style": "margin-left:1em;", "xhtml:div": {"@style": "margin-left:1em;", "xhtml:br": null, "#text": "Runnable r = ...;r.run();"}, "#text": "for (;;) {}"}, {"@style": "margin-left:1em;", "#text": "..."}], "#text": "try {}catch (InterruptedException ie) {}"}}, "#text": "public void run() {}"}}, "#text": "Runnable loop = new Runnable() {};new Thread(loop).start();"}}], "#text": "...public void execute(Runnable r) {}\n                           public Worker(Channel ch, int nworkers) {}\n                           protected void activate() {}"}}, "#text": "class Worker implements Executor {}"}}, "Body_Text": "There are no limits to runnables. Potentially an attacker could cause resource problems very quickly."}, {"@Demonstrative_Example_ID": "DX-25", "Intro_Text": "This code allocates a socket and forks each time it receives a new connection.", "Example_Code": {"@Nature": "Bad", "@Language": "C", "xhtml:div": {"xhtml:br": null, "xhtml:div": {"@style": "margin-left:1em;", "xhtml:br": [null, null], "#text": "newsock=accept(sock, ...);printf(\"A connection has been accepted\\n\");pid = fork();"}, "#text": "sock=socket(AF_INET, SOCK_STREAM, 0);while (1) {}"}}, "Body_Text": "The program does not track how many connections have been made, and it does not limit the number of connections. Because forking is a relatively expensive operation, an attacker would be able to cause the system to run out of CPU, processes, or memory by making a large number of connections. Alternatively, an attacker could consume all available connections, preventing others from accessing the system remotely."}, {"@Demonstrative_Example_ID": "DX-50", "Intro_Text": "In the following example a server socket connection is used to accept a request to store data on the local file system using a specified filename. The method openSocketConnection establishes a server socket to accept requests from a client. When a client establishes a connection to this service the getNextMessage method is first used to retrieve from the socket the name of the file to store the data, the openFileToWrite method will validate the filename and open a file to write to on the local file system. The getNextMessage is then used within a while loop to continuously read data from the socket and output the data to the file until there is no longer any data from the socket.", "Example_Code": {"@Nature": "Bad", "@Language": "C", "xhtml:div": {"xhtml:br": null, "xhtml:div": {"@style": "margin-left:1em;", "xhtml:div": {"xhtml:br": [null, null, null, null, null, null, null], "xhtml:div": [{"@style": "margin-left:1em;", "xhtml:br": null, "#text": "printf(\"Unable to open socket connection\");return(FAIL);"}, {"@style": "margin-left:1em;", "xhtml:div": {"xhtml:div": {"@style": "margin-left:1em;", "xhtml:div": {"xhtml:div": {"@style": "margin-left:1em;", "xhtml:div": {"@style": "margin-left:1em;", "#text": "break;"}, "#text": "if (!(writeToFile(buffer) > 0))"}, "#text": "while (getNextMessage(socket, buffer, BUFFER_SIZE) > 0){}"}}, "xhtml:br": null, "#text": "if (openFileToWrite(filename) > 0) {}closeFile();"}}], "#text": "char filename[FILENAME_SIZE];char buffer[BUFFER_SIZE];int socket = openSocketConnection(host, port);\n                           if (socket < 0) {}if (getNextMessage(socket, filename, FILENAME_SIZE) > 0) {}closeSocket(socket);"}}, "#text": "int writeDataFromSocketToFile(char *host, int port){}"}}, "Body_Text": "This example creates a situation where data can be dumped to a file on the local file system without any limits on the size of the file. This could potentially exhaust file or disk resources and/or limit other clients' ability to access the service."}, {"@Demonstrative_Example_ID": "DX-51", "Intro_Text": "In the following example, the processMessage method receives a two dimensional character array containing the message to be processed. The two-dimensional character array contains the length of the message in the first character array and the message body in the second character array. The getMessageLength method retrieves the integer value of the length from the first character array. After validating that the message length is greater than zero, the body character array pointer points to the start of the second character array of the two-dimensional character array and memory is allocated for the new body character array.", "Example_Code": [{"@Nature": "Bad", "@Language": "C", "xhtml:div": {"xhtml:br": [null, null, null], "xhtml:i": "/* process message accepts a two-dimensional character array of the form [length][body] containing the message to be processed */", "xhtml:div": {"@style": "margin-left:1em;", "xhtml:div": {"xhtml:br": [null, null, null, null, null], "xhtml:div": [{"@style": "margin-left:1em;", "xhtml:br": [null, null], "#text": "body = &message[1][0];processMessageBody(body);return(SUCCESS);"}, {"@style": "margin-left:1em;", "xhtml:br": null, "#text": "printf(\"Unable to process message; invalid message length\");return(FAIL);"}], "#text": "char *body;\n                           int length = getMessageLength(message[0]);\n                           if (length > 0) {}else {}"}}, "#text": "int processMessage(char **message){}"}}, {"@Nature": "Good", "@Language": "C", "xhtml:div": {"xhtml:br": null, "#text": "unsigned int length = getMessageLength(message[0]);if ((length > 0) && (length < MAX_LENGTH)) {...}"}}], "Body_Text": ["This example creates a situation where the length of the body character array can be very large and will consume excessive memory, exhausting system resources. This can be avoided by restricting the length of the second character array with a maximum length check", "Also, consider changing the type from 'int' to 'unsigned int', so that you are always guaranteed that the number is positive. This might not be possible if the protocol specifically requires allowing negative values, or if you cannot control the return value from getMessageLength(), but it could simplify the check to ensure the input is positive, and eliminate other errors such as signed-to-unsigned conversion errors (CWE-195) that may occur elsewhere in the code."]}, {"@Demonstrative_Example_ID": "DX-52", "Intro_Text": "In the following example, a server object creates a server socket and accepts client connections to the socket. For every client connection to the socket a separate thread object is generated using the ClientSocketThread class that handles request made by the client through the socket.", "Example_Code": [{"@Nature": "Bad", "@Language": "Java", "xhtml:div": {"xhtml:br": null, "xhtml:div": {"@style": "margin-left:1em;", "xhtml:div": {"xhtml:div": {"@style": "margin-left:1em;", "xhtml:br": [null, null, null, null], "xhtml:div": {"@style": "margin-left:1em;", "xhtml:br": [null, null, null], "#text": "Socket client = serverSocket.accept();Thread t = new Thread(new ClientSocketThread(client));t.setName(client.getInetAddress().getHostName() + \":\" + counter++);t.start();"}, "#text": "ServerSocket serverSocket = new ServerSocket(SERVER_PORT);int counter = 0;boolean hasConnections = true;while (hasConnections) {}serverSocket.close();"}, "xhtml:br": [null, null], "#text": "try {\n                           \n                           } catch (IOException ex) {...}"}}, "#text": "public void acceptConnections() {\n                     }"}}, {"@Nature": "Good", "@Language": "Java", "xhtml:div": {"xhtml:br": [null, null, null, null, null], "xhtml:div": {"@style": "margin-left:1em;", "xhtml:div": {"xhtml:div": {"@style": "margin-left:1em;", "xhtml:br": [null, null, null, null], "xhtml:div": {"@style": "margin-left:1em;", "xhtml:br": [null, null, null, null, null], "#text": "hasConnections = checkForMoreConnections();Socket client = serverSocket.accept();Thread t = new Thread(new ClientSocketThread(client));t.setName(client.getInetAddress().getHostName() + \":\" + counter++);ExecutorService pool = Executors.newFixedThreadPool(MAX_CONNECTIONS);pool.execute(t);"}, "#text": "ServerSocket serverSocket = new ServerSocket(SERVER_PORT);int counter = 0;boolean hasConnections = true;while (hasConnections) {}serverSocket.close();"}, "xhtml:br": [null, null], "#text": "try {\n                           \n                           } catch (IOException ex) {...}"}}, "#text": "public static final int SERVER_PORT = 4444;public static final int MAX_CONNECTIONS = 10;...\n                     public void acceptConnections() {\n                     }"}}], "Body_Text": ["In this example there is no limit to the number of client connections and client threads that are created. Allowing an unlimited number of client connections and threads could potentially overwhelm the system and system resources.", "The server should limit the number of client connections and the client threads that are created. This can be easily done by creating a thread pool object that limits the number of threads that are generated."]}, {"Intro_Text": "In the following example, the serve function receives an http request and an http response writer. It reads the entire request body.", "Example_Code": [{"@Nature": "Bad", "@Language": "Go", "xhtml:div": {"xhtml:div": {"@style": "margin-left:1em;", "xhtml:br": [null, null], "xhtml:div": {"@style": "margin-left:1em;", "xhtml:br": null, "xhtml:div": {"@style": "margin-left:1em;", "xhtml:br": null, "#text": "body = data"}, "#text": "if data, err := io.ReadAll(r.Body); err == nil {\n                           \n                           }"}, "#text": "var body []byte\n                        if r.Body != nil {\n                        \n                        }"}, "#text": "func serve(w http.ResponseWriter, r *http.Request) {\n                     \n                  }"}}, {"@Nature": "Good", "@Language": "Go", "xhtml:div": {"xhtml:div": {"@style": "margin-left:1em;", "xhtml:br": [null, null, null], "xhtml:div": {"@style": "margin-left:1em;", "xhtml:br": [null, null], "xhtml:div": {"@style": "margin-left:1em;", "xhtml:br": null, "#text": "body = data"}, "#text": "r.Body = http.MaxBytesReader(w, r.Body, MaxRespBodyLength)\n                           if data, err := io.ReadAll(r.Body); err == nil {\n                           \n                           }"}, "#text": "var body []byte\n                        const MaxRespBodyLength = 1e6\n                        if r.Body != nil {\n                        \n                        }"}, "#text": "func serve(w http.ResponseWriter, r *http.Request) {\n                     \n                  }"}}], "Body_Text": ["Because ReadAll is defined to read from src until EOF, it does not treat an EOF from Read as an error to be reported. This example creates a situation where the length of the body supplied can be very large and will consume excessive memory, exhausting system resources. This can be avoided by ensuring the body does not exceed a predetermined length of bytes.", "MaxBytesReader prevents clients from accidentally or maliciously sending a large request and wasting server resources. If possible, the code could be changed to tell ResponseWriter to close the connection after the limit has been reached."]}]}, "Observed_Examples": {"Observed_Example": [{"Reference": "CVE-2022-21668", "Description": "Chain: Python library does not limit the resources used to process images that specify a very large number of bands (CWE-1284), leading to excessive memory consumption (CWE-789) or an integer overflow (CWE-190).", "Link": "https://www.cve.org/CVERecord?id=CVE-2022-21668"}, {"Reference": "CVE-2020-7218", "Description": "Go-based workload orchestrator does not limit resource usage with unauthenticated connections, allowing a DoS by flooding the service", "Link": "https://www.cve.org/CVERecord?id=CVE-2020-7218"}, {"Reference": "CVE-2020-3566", "Description": "Resource exhaustion in distributed OS because of \"insufficient\" IGMP queue management, as exploited in the wild per CISA KEV.", "Link": "https://www.cve.org/CVERecord?id=CVE-2020-3566"}, {"Reference": "CVE-2009-2874", "Description": "Product allows attackers to cause a crash via a large number of connections.", "Link": "https://www.cve.org/CVERecord?id=CVE-2009-2874"}, {"Reference": "CVE-2009-1928", "Description": "Malformed request triggers uncontrolled recursion, leading to stack exhaustion.", "Link": "https://www.cve.org/CVERecord?id=CVE-2009-1928"}, {"Reference": "CVE-2009-2858", "Description": "Chain: memory leak (CWE-404) leads to resource exhaustion.", "Link": "https://www.cve.org/CVERecord?id=CVE-2009-2858"}, {"Reference": "CVE-2009-2726", "Description": "Driver does not use a maximum width when invoking sscanf style functions, causing stack consumption.", "Link": "https://www.cve.org/CVERecord?id=CVE-2009-2726"}, {"Reference": "CVE-2009-2540", "Description": "Large integer value for a length property in an object causes a large amount of memory allocation.", "Link": "https://www.cve.org/CVERecord?id=CVE-2009-2540"}, {"Reference": "CVE-2009-2299", "Description": "Web application firewall consumes excessive memory when an HTTP request contains a large Content-Length value but no POST data.", "Link": "https://www.cve.org/CVERecord?id=CVE-2009-2299"}, {"Reference": "CVE-2009-2054", "Description": "Product allows exhaustion of file descriptors when processing a large number of TCP packets.", "Link": "https://www.cve.org/CVERecord?id=CVE-2009-2054"}, {"Reference": "CVE-2008-5180", "Description": "Communication product allows memory consumption with a large number of SIP requests, which cause many sessions to be created.", "Link": "https://www.cve.org/CVERecord?id=CVE-2008-5180"}, {"Reference": "CVE-2008-2121", "Description": "TCP implementation allows attackers to consume CPU and prevent new connections using a TCP SYN flood attack.", "Link": "https://www.cve.org/CVERecord?id=CVE-2008-2121"}, {"Reference": "CVE-2008-2122", "Description": "Port scan triggers CPU consumption with processes that attempt to read data from closed sockets.", "Link": "https://www.cve.org/CVERecord?id=CVE-2008-2122"}, {"Reference": "CVE-2008-1700", "Description": "Product allows attackers to cause a denial of service via a large number of directives, each of which opens a separate window.", "Link": "https://www.cve.org/CVERecord?id=CVE-2008-1700"}, {"Reference": "CVE-2007-4103", "Description": "Product allows resource exhaustion via a large number of calls that do not complete a 3-way handshake.", "Link": "https://www.cve.org/CVERecord?id=CVE-2007-4103"}, {"Reference": "CVE-2006-1173", "Description": "Mail server does not properly handle deeply nested multipart MIME messages, leading to stack exhaustion.", "Link": "https://www.cve.org/CVERecord?id=CVE-2006-1173"}, {"Reference": "CVE-2007-0897", "Description": "Chain: anti-virus product encounters a malformed file but returns from a function without closing a file descriptor (CWE-775) leading to file descriptor consumption (CWE-400) and failed scans.", "Link": "https://www.cve.org/CVERecord?id=CVE-2007-0897"}]}, "Taxonomy_Mappings": {"Taxonomy_Mapping": [{"@Taxonomy_Name": "CLASP", "Entry_Name": "Resource exhaustion (file descriptor, disk space, sockets, ...)"}, {"@Taxonomy_Name": "OWASP Top Ten 2004", "Entry_ID": "A9", "Entry_Name": "Denial of Service", "Mapping_Fit": "CWE More Specific"}, {"@Taxonomy_Name": "WASC", "Entry_ID": "10", "Entry_Name": "Denial of Service"}, {"@Taxonomy_Name": "WASC", "Entry_ID": "41", "Entry_Name": "XML Attribute Blowup"}, {"@Taxonomy_Name": "The CERT Oracle Secure Coding Standard for Java (2011)", "Entry_ID": "SER12-J", "Entry_Name": "Avoid memory and resource leaks during serialization"}, {"@Taxonomy_Name": "The CERT Oracle Secure Coding Standard for Java (2011)", "Entry_ID": "MSC05-J", "Entry_Name": "Do not exhaust heap space"}, {"@Taxonomy_Name": "Software Fault Patterns", "Entry_ID": "SFP13", "Entry_Name": "Unrestricted Consumption"}, {"@Taxonomy_Name": "ISA/IEC 62443", "Entry_ID": "Part 3-3", "Entry_Name": "Req SR 7.1"}, {"@Taxonomy_Name": "ISA/IEC 62443", "Entry_ID": "Part 3-3", "Entry_Name": "Req SR 7.2"}, {"@Taxonomy_Name": "ISA/IEC 62443", "Entry_ID": "Part 4-1", "Entry_Name": "Req SI-1"}, {"@Taxonomy_Name": "ISA/IEC 62443", "Entry_ID": "Part 4-1", "Entry_Name": "Req SVV-3"}, {"@Taxonomy_Name": "ISA/IEC 62443", "Entry_ID": "Part 4-2", "Entry_Name": "Req CR 7.1"}, {"@Taxonomy_Name": "ISA/IEC 62443", "Entry_ID": "Part 4-2", "Entry_Name": "Req CR 7.2"}]}, "Related_Attack_Patterns": {"Related_Attack_Pattern": [{"@CAPEC_ID": "147"}, {"@CAPEC_ID": "227"}, {"@CAPEC_ID": "492"}]}, "References": {"Reference": [{"@External_Reference_ID": "REF-18"}, {"@External_Reference_ID": "REF-386"}, {"@External_Reference_ID": "REF-387"}, {"@External_Reference_ID": "REF-388"}, {"@External_Reference_ID": "REF-7", "@Section": "Chapter 17, \"Protecting Against Denial of Service Attacks\" Page 517"}]}, "Notes": {"Note": [{"@Type": "Maintenance", "#text": "\"Resource consumption\" could be interpreted as a consequence instead of an insecure behavior, so this entry is being considered for modification.  It appears to be referenced too frequently when more precise mappings are available.  Some of its children, such as CWE-771, might be better considered as a chain."}, {"@Type": "Theoretical", "#text": "Vulnerability theory is largely about how behaviors and resources interact. \"Resource exhaustion\" can be regarded as either a consequence or an attack, depending on the perspective. This entry is an attempt to reflect the underlying weaknesses that enable these attacks (or consequences) to take place."}, {"@Type": "Other", "xhtml:p": ["Database queries that take a long time to process are good DoS targets. An attacker would have to write a few lines of Perl code to generate enough traffic to exceed the site's ability to keep up. This would effectively prevent authorized users from using the site at all. Resources can be exploited simply by ensuring that the target machine must do much more work and consume more resources in order to service a request than the attacker must do to initiate a request.", "A prime example of this can be found in old switches that were vulnerable to \"macof\" attacks (so named for a tool developed by Dugsong). These attacks flooded a switch with random IP and MAC address combinations, therefore exhausting the switch's cache, which held the information of which port corresponded to which MAC addresses. Once this cache was exhausted, the switch would fail in an insecure way and would begin to act simply as a hub, broadcasting all traffic on all ports and allowing for basic sniffing attacks."]}, {"@Type": "Maintenance", "#text": "The Taxonomy_Mappings to ISA/IEC 62443 were added in CWE 4.10, but they are still under review and might change in future CWE versions. These draft mappings were performed by members of the \"Mapping CWE to 62443\" subgroup of the CWE-CAPEC ICS/OT Special Interest Group (SIG), and their work is incomplete as of CWE 4.10. The mappings are included to facilitate discussion and review by the broader ICS/OT community, and they are likely to change in future CWE versions."}]}, "Content_History": {"Submission": {"Submission_Name": "CLASP", "Submission_Date": "2006-07-19"}, "Modification": [{"Modification_Name": "Eric Dalci", "Modification_Organization": "Cigital", "Modification_Date": "2008-07-01", "Modification_Comment": "updated Time_of_Introduction"}, {"Modification_Organization": "Veracode", "Modification_Date": "2008-08-15", "Modification_Comment": "Suggested OWASP Top Ten 2004 mapping"}, {"Modification_Name": "CWE Content Team", "Modification_Organization": "MITRE", "Modification_Date": "2008-09-08", "Modification_Comment": "updated Common_Consequences, Relationships, Other_Notes, Taxonomy_Mappings"}, {"Modification_Name": "CWE Content Team", "Modification_Organization": "MITRE", "Modification_Date": "2008-10-14", "Modification_Comment": "updated Description, Name, Relationships"}, {"Modification_Name": "CWE Content Team", "Modification_Organization": "MITRE", "Modification_Date": "2009-01-12", "Modification_Comment": "updated Description"}, {"Modification_Name": "CWE Content Team", "Modification_Organization": "MITRE", "Modification_Date": "2009-05-27", "Modification_Comment": "updated Name, Relationships"}, {"Modification_Name": "CWE Content Team", "Modification_Organization": "MITRE", "Modification_Date": "2009-07-27", "Modification_Comment": "updated Description, Relationships"}, {"Modification_Name": "CWE Content Team", "Modification_Organization": "MITRE", "Modification_Date": "2009-10-29", "Modification_Comment": "updated Relationships"}, {"Modification_Name": "CWE Content Team", "Modification_Organization": "MITRE", "Modification_Date": "2009-12-28", "Modification_Comment": "updated Common_Consequences, Demonstrative_Examples, Detection_Factors, Likelihood_of_Exploit, Observed_Examples, Other_Notes, Potential_Mitigations, References"}, {"Modification_Name": "CWE Content Team", "Modification_Organization": "MITRE", "Modification_Date": "2010-02-16", "Modification_Comment": "updated Detection_Factors, Potential_Mitigations, References, Taxonomy_Mappings"}, {"Modification_Name": "CWE Content Team", "Modification_Organization": "MITRE", "Modification_Date": "2010-04-05", "Modification_Comment": "updated Related_Attack_Patterns"}, {"Modification_Name": "CWE Content Team", "Modification_Organization": "MITRE", "Modification_Date": "2010-06-21", "Modification_Comment": "updated Description"}, {"Modification_Name": "CWE Content Team", "Modification_Organization": "MITRE", "Modification_Date": "2010-09-27", "Modification_Comment": "updated Demonstrative_Examples"}, {"Modification_Name": "CWE Content Team", "Modification_Organization": "MITRE", "Modification_Date": "2011-06-01", "Modification_Comment": "updated Common_Consequences, Relationships, Taxonomy_Mappings"}, {"Modification_Name": "CWE Content Team", "Modification_Organization": "MITRE", "Modification_Date": "2012-05-11", "Modification_Comment": "updated Demonstrative_Examples, Related_Attack_Patterns, Relationships, Taxonomy_Mappings"}, {"Modification_Name": "CWE Content Team", "Modification_Organization": "MITRE", "Modification_Date": "2013-07-17", "Modification_Comment": "updated Relationships"}, {"Modification_Name": "CWE Content Team", "Modification_Organization": "MITRE", "Modification_Date": "2014-07-30", "Modification_Comment": "updated Relationships, Taxonomy_Mappings"}, {"Modification_Name": "CWE Content Team", "Modification_Organization": "MITRE", "Modification_Date": "2015-12-07", "Modification_Comment": "updated Related_Attack_Patterns, Relationships"}, {"Modification_Name": "CWE Content Team", "Modification_Organization": "MITRE", "Modification_Date": "2017-01-19", "Modification_Comment": "updated Relationships"}, {"Modification_Name": "CWE Content Team", "Modification_Organization": "MITRE", "Modification_Date": "2017-11-08", "Modification_Comment": "updated Applicable_Platforms, Demonstrative_Examples, Likelihood_of_Exploit, Potential_Mitigations, References, Relationships"}, {"Modification_Name": "CWE Content Team", "Modification_Organization": "MITRE", "Modification_Date": "2018-03-27", "Modification_Comment": "updated References, Type"}, {"Modification_Name": "CWE Content Team", "Modification_Organization": "MITRE", "Modification_Date": "2019-01-03", "Modification_Comment": "updated Alternate_Terms, Description, Name, Relationships, Taxonomy_Mappings, Theoretical_Notes"}, {"Modification_Name": "CWE Content Team", "Modification_Organization": "MITRE", "Modification_Date": "2019-06-20", "Modification_Comment": "updated Related_Attack_Patterns, Relationships"}, {"Modification_Name": "CWE Content Team", "Modification_Organization": "MITRE", "Modification_Date": "2019-09-19", "Modification_Comment": "updated Description, Relationships"}, {"Modification_Name": "CWE Content Team", "Modification_Organization": "MITRE", "Modification_Date": "2020-02-24", "Modification_Comment": "updated Description, References, Related_Attack_Patterns, Relationships"}, {"Modification_Name": "CWE Content Team", "Modification_Organization": "MITRE", "Modification_Date": "2020-06-25", "Modification_Comment": "updated Description, Maintenance_Notes"}, {"Modification_Name": "CWE Content Team", "Modification_Organization": "MITRE", "Modification_Date": "2020-08-20", "Modification_Comment": "updated Relationships"}, {"Modification_Name": "CWE Content Team", "Modification_Organization": "MITRE", "Modification_Date": "2022-04-28", "Modification_Comment": "updated Related_Attack_Patterns"}, {"Modification_Name": "CWE Content Team", "Modification_Organization": "MITRE", "Modification_Date": "2022-06-28", "Modification_Comment": "updated Observed_Examples, Relationships"}, {"Modification_Name": "CWE Content Team", "Modification_Organization": "MITRE", "Modification_Date": "2022-10-13", "Modification_Comment": "updated Observed_Examples, Relationships"}, {"Modification_Name": "CWE Content Team", "Modification_Organization": "MITRE", "Modification_Date": "2023-01-31", "Modification_Comment": "updated Common_Consequences, Description, Detection_Factors, Maintenance_Notes, Related_Attack_Patterns, Taxonomy_Mappings"}, {"Modification_Name": "CWE Content Team", "Modification_Organization": "MITRE", "Modification_Date": "2023-04-27", "Modification_Comment": "updated Demonstrative_Examples, Relationships, Taxonomy_Mappings"}], "Contribution": [{"@Type": "Content", "Contribution_Name": "\"Mapping CWE to 62443\" Sub-Working Group", "Contribution_Organization": "CWE-CAPEC ICS/OT SIG", "Contribution_Date": "2023-01-24", "Contribution_Comment": "Suggested mappings to ISA/IEC 62443."}, {"@Type": "Content", "Contribution_Name": "\"Mapping CWE to 62443\" Sub-Working Group", "Contribution_Organization": "CWE-CAPEC ICS/OT SIG", "Contribution_Date": "2023-04-25", "Contribution_Comment": "Suggested mappings to ISA/IEC 62443."}], "Previous_Entry_Name": [{"@Date": "2008-10-14", "#text": "Resource Exhaustion"}, {"@Date": "2009-05-27", "#text": "Uncontrolled Resource Consumption (aka 'Resource Exhaustion')"}, {"@Date": "2019-01-03", "#text": "Uncontrolled Resource Consumption ('Resource Exhaustion')"}]}}, "copyright": "Copyright © 2006–2023, The MITRE Corporation. CWE, CWSS, CWRAF, and the CWE logo are trademarks of The MITRE Corporation.", "license": "CWE Usage: MITRE hereby grants you a non-exclusive, royalty-free license to use CWE for research, development, and commercial purposes. Any copy you make for such purposes is authorized on the condition that you reproduce MITRE’s copyright designation and this license in any such copy."}